Tekla Open API Reference for Tekla Structures 2025
IRelatedObjects.GetRelatedObjects Method
 Gets the related objects of the current object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
DrawingObjectEnumerator GetRelatedObjects()
Function GetRelatedObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The related objects of the current object.
See Also
Reference
IRelatedObjects Interface
GetRelatedObjects Overload
Tekla.Structures.Drawing Namespace